src/InformationRegisters/ОчередьПолученияИзмененийОбъектовВерсийХранилища/ОчередьПолученияИзмененийОбъектовВерсийХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьПолученияИзмененийОбъектовВерсийХранилища</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОперацийОбработкиОчереди</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СоставЛогическихПодсистем/СоставЛогическихПодсистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставЛогическихПодсистем</name>
  <resources>
    <name>ЛогическаяПодсистема</name>
    <type>
      <types>CatalogRef.ЛогическиеПодсистемы</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОчередьОповещенийИзмененияМетаданныхRMQ/ОчередьОповещенийИзмененияМетаданныхRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОповещенийИзмененияМетаданныхRMQ</name>
  <comment>для RabbitMQ</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОперацийОбработкиОчереди</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИзмененияСвойствОбъектовМетаданных/ИзмененияСвойствОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзмененияСвойствОбъектовМетаданных</name>
  <resources>
    <name>Изменение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВидИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСвойства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыОперацийОбработкиОчереди/СтатусыОперацийОбработкиОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОперацийОбработкиОчереди</name>
  <enumValues>
    <name>ОжидаетОбработки</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Конфигурации/Конфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Конфигурации</name>
  <predefined>
    <items>
      <name>Финансы1С</name>
      <description>Финансы 1 С</description>
    </items>
  </predefined>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеРазработки</name>
    <type>
      <types>CatalogRef.Хранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОбновления</name>
    <type>
      <types>CatalogRef.Хранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяКонвейерОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьБазыТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогическаяПодсистемаПоУмолчанию</name>
    <type>
      <types>CatalogRef.ЛогическиеПодсистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектGitEDT</name>
    <type>
      <types>CatalogRef.ПроектыGIT</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеВремяЗахватаПоУмолчаниюЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсключаемыеАвторы</name>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШагиКонвейера</name>
    <attributes>
      <name>ДействиеКонвейераОбработки</name>
      <type>
        <types>CatalogRef.ДействияКонвейераОбработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТестовыеБазы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаСоединенияИсточник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаСоединенияПриемник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыЗапускаИнтеграционныхТестов</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Хранилища/Хранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Хранилища</name>
  <owners>Catalog.Конфигурации</owners>
  <attributes>
    <name>Путь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьВGit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПапкиGit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВАПК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеРазработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовоеХранилище</name>
    <type>
      <types>CatalogRef.Хранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьТегиВGit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогРезультатовПайплайнов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаИсторииСтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаИсторииИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаИсторииПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаИсторииИмяПользователяХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаИсторииПарольХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаПереносаСтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаПереносаИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаПереносаПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаПереносаИмяПользователяХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаПереносаПарольХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GitИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GitПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроектGit</name>
    <type>
      <types>CatalogRef.ПроектыGIT</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьHTTP</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьЗахваченныеОбъектыХранилищ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ЗагрузкаМетаданныхСлужебный/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////////////////////////
// Методы для загрузки описания метаданных конфигурации
//  
//////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗагрузитьМетаданныеОбработчикЗадания() Экспорт
	
	//РегЗадания.ПроверитьРазрешениеЗапускаРегламентныхЗаданий();
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Конфигурации.Ссылка КАК Конфигурация,
		|	Конфигурации.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Конфигурации КАК Конфигурации
		|ГДЕ
		|	Конфигурации.ХранилищеРазработки.ВыгружатьВGit
		|	И НЕ Конфигурации.ПометкаУдаления
		|	И НЕ Конфигурации.ХранилищеРазработки = ЗНАЧЕНИЕ(Справочник.Хранилища.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НаборПараметровПотоков = Новый Соответствие;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборПараметровПотоков.Вставить(
			ВыборкаДетальныеЗаписи.Наименование,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаДетальныеЗаписи.Конфигурация));	
	КонецЦикла;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Загрузка метаданных конфигураций";
	ПараметрыВыполнения.КлючФоновогоЗадания = "ЗагрузкаМетеданныхМногопоточно";
	ПараметрыВыполнения.ОжидатьЗавершение = Неопределено;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Результат = ДлительныеОперации.ВыполнитьПроцедуруВНесколькоПотоков(
		"ЗагрузкаМетаданных.ЗагрузитьМетаданные", ПараметрыВыполнения, НаборПараметровПотоков);

	Пока Не Результат.ИдентификаторЗадания = Неопределено И Не ДлительныеОперации.ЗаданиеВыполнено(Результат.ИдентификаторЗадания) Цикл
		ОбновлениеИнформационнойБазыСлужебный.Пауза(30);
	КонецЦикла;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени(
		"ЗагрузкаМетаданныхРегламентноеЗадание",
		ВремяНачалаЗамера,
		,
		СтрШаблон("Количество конфигураций: %1", ВыборкаДетальныеЗаписи.Количество()));
	
КонецПроцедуры

Процедура ЗагрузкаИзмененияСвойствОбъектовМетаданныхОбработчикЗадания() Экспорт
	
	//РегЗадания.ПроверитьРазрешениеЗапускаРегламентныхЗаданий();
	ШаблонКлючаФоновогоЗаданияПотоков = "ЗагрузкаИзмененияСвойствОбъектов_%1_%2";
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтатусОжидаетОбработки", Перечисления.СтатусыОперацийОбработкиОчереди.ОжидаетОбработки);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьПолученияИзмененийОбъектовВерсийХранилищаСрезПоследних.ВерсияХранилища КАК ВерсияХранилища,
		|	ОчередьПолученияИзмененийОбъектовВерсийХранилищаСрезПоследних.ВерсияХранилища.Код КАК КодВерсии,
		|	ОчередьПолученияИзмененийОбъектовВерсийХранилищаСрезПоследних.ВерсияХранилища.Владелец.Наименование КАК НаименованиеХранилища
		|ИЗ
		|	РегистрСведений.ОчередьПолученияИзмененийОбъектовВерсийХранилища.СрезПоследних КАК ОчередьПолученияИзмененийОбъектовВерсийХранилищаСрезПоследних
		|ГДЕ
		|	ОчередьПолученияИзмененийОбъектовВерсийХранилищаСрезПоследних.Статус = &СтатусОжидаетОбработки";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НаборПараметровПотоков = Новый Соответствие();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборПараметровПотоков.Вставить(
			СтрШаблон(ШаблонКлючаФоновогоЗаданияПотоков,  ВыборкаДетальныеЗаписи.НаименованиеХранилища, ВыборкаДетальныеЗаписи.КодВерсии),
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаДетальныеЗаписи.ВерсияХранилища));	
	КонецЦикла;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Загрузка изменений свойств объектов";
	ПараметрыВыполнения.КлючФоновогоЗадания = "ЗагрузкаИзмененияСвойствОбъектовМногопоточно";
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	// TODO: Отладка
	//ПараметрыВыполнения.ЗапуститьНеВФоне = Истина;
	//ПараметрыВыполнения.ЗапуститьВФоне = Ложь;
	
	Результат = ДлительныеОперации.ВыполнитьПроцедуруВНесколькоПотоков(
		"ЗагрузкаМетаданныхСлужебный.ЗагрузитьИзмененияСвойствОбъектовМетаданныхВерсииХранилища", ПараметрыВыполнения, НаборПараметровПотоков);

	//Пока Не Результат.ИдентификаторЗадания = Неопределено И Не ДлительныеОперации.ЗаданиеВыполнено(Результат.ИдентификаторЗадания) Цикл
	//	ОбновлениеИнформационнойБазыСлужебный.Пауза(30);
	//КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнениеЛогическойПодсистемыПоУмолчаниюОбработчикЗадания() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Конфигурации.ЛогическаяПодсистемаПоУмолчанию КАК ЛогическаяПодсистема,
		|	Конфигурации.ХранилищеРазработки КАК ХранилищеРазработки,
		|	Конфигурации.Ссылка КАК Конфигурация
		|ПОМЕСТИТЬ ЛогическиеПодсистемыКонфигураций
		|ИЗ
		|	Справочник.Конфигурации КАК Конфигурации
		|ГДЕ
		|	НЕ Конфигурации.ЛогическаяПодсистемаПоУмолчанию = ЗНАЧЕНИЕ(Справочник.ЛогическиеПодсистемы.ПустаяСсылка)
		|	И НЕ Конфигурации.ХранилищеРазработки = ЗНАЧЕНИЕ(Справочник.Хранилища.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъектыМетаданных.Ссылка КАК ОбъектМетаданных,
		|	ЛогическиеПодсистемыКонфигураций.ЛогическаяПодсистема КАК ЛогическаяПодсистема
		|ИЗ
		|	Справочник.ОбъектыМетаданных КАК ОбъектыМетаданных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставЛогическихПодсистем КАК СоставЛогическихПодсистем
		|		ПО ОбъектыМетаданных.Ссылка = СоставЛогическихПодсистем.ОбъектМетаданных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЛогическиеПодсистемыКонфигураций КАК ЛогическиеПодсистемыКонфигураций
		|		ПО ОбъектыМетаданных.Владелец = ЛогическиеПодсистемыКонфигураций.Конфигурация
		|ГДЕ
		|	ОбъектыМетаданных.Владелец В
		|			(ВЫБРАТЬ
		|				ЛогическиеПодсистемыКонфигураций.Конфигурация КАК Конфигурация
		|			ИЗ
		|				ЛогическиеПодсистемыКонфигураций КАК ЛогическиеПодсистемыКонфигураций)
		|	И СоставЛогическихПодсистем.ОбъектМетаданных ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.СоставЛогическихПодсистем.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектМетаданных.Установить(ВыборкаДетальныеЗаписи.ОбъектМетаданных);
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		НаборЗаписей.Записать(Ложь);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправкаОповещенийИзмененияМетаданныхRMQОбработчикЗадания() Экспорт
	
	// TODO: 
	//РегЗадания.ПроверитьРазрешениеЗапускаРегламентныхЗаданий();
	ШаблонУрлМетода = "/metadata_changes";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыОперацийОбработкиОчереди.Обработано);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьОповещенийИзмененияМетаданныхRMQСрезПоследних.Конфигурация КАК КонфигурацияСсылка,
		|	ОчередьОповещенийИзмененияМетаданныхRMQСрезПоследних.ИмяОбъектаМетаданных КАК ИмяОбъектаМетаданных,
		|	ОчередьОповещенийИзмененияМетаданныхRMQСрезПоследних.Конфигурация.Наименование КАК Конфигурация
		|ИЗ
		|	РегистрСведений.ОчередьОповещенийИзмененияМетаданныхRMQ.СрезПоследних КАК ОчередьОповещенийИзмененияМетаданныхRMQСрезПоследних
		|ГДЕ
		|	ОчередьОповещенийИзмененияМетаданныхRMQСрезПоследних.Статус <> &Статус";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	Изменения = РезультатЗапроса.Выгрузить().Скопировать(, "Конфигурация, ИмяОбъектаМетаданных");
	ИзмененияДжсон = КоннекторHTTP.ОбъектВJson(ОбщегоНазначения.ТаблицаЗначенийВМассив(Изменения));
	
	УРЛ = Константы.АдресСервисаRMQ.Получить() + ШаблонУрлМетода;
	ПараметрыАутентификации = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("СервисRMQ", "Пользователь,Пароль");
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Аутентификация", ПараметрыАутентификации);
	Ответ = КоннекторHTTP.Post(УРЛ, ИзмененияДжсон, ДополнительныеПараметры);
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Ответ.КодСостояния >= 300 Тогда
		ТекстОшибкиСервиса = КоннекторHTTP.КакТекст(Ответ);
		Ответ.Удалить("Тело");
		ТекстОшибки = СтрШаблон(
			"При выполнении обращения к сервису RabbitMQ возникла ошибка:
			|%1,
			|Данные ответа:
			|%2",
			ТекстОшибкиСервиса,
			КоннекторHTTP.ОбъектВJson(Ответ));
		Пока Выборка.Следующий() Цикл
			Менеджер = РегистрыСведений.ОчередьОповещенийИзмененияМетаданныхRMQ.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Менеджер, Выборка);
			Менеджер.Период = ТекущаяДатаСеанса();
			Менеджер.Конфигурация = Выборка.КонфигурацияСсылка;
			Менеджер.Статус = Перечисления.СтатусыОперацийОбработкиОчереди.Ошибка;
			Менеджер.Комментарий = ТекстОшибки;
			Менеджер.Записать();
		КонецЦикла;
		ЗаписьЖурналаРегистрации(
			"Отправка изменений метаданных",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ОчередьОповещенийИзмененияМетаданныхRMQ,
			,
			ТекстОшибки);
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		Менеджер = РегистрыСведений.ОчередьОповещенийИзмененияМетаданныхRMQ.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер, Выборка);
		Менеджер.Конфигурация = Выборка.КонфигурацияСсылка;
		Менеджер.Период = ТекущаяДатаСеанса();
		Менеджер.Статус = Перечисления.СтатусыОперацийОбработкиОчереди.Обработано;
		Менеджер.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗагрузитьИзмененияСвойствОбъектовМетаданныхВерсииХранилища(ВерсияХранилища) Экспорт
	
	Изменения = ЗагрузкаМетаданных.ИзмененияМетаданныхОбъектовВерсии(ВерсияХранилища);
	// В случае ошибки получения данных из гитлаб нужно попробовать ещё раз.
	Если Изменения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТипыПолей = Новый Массив();
	ТипыПолей.Добавить("Реквизиты");
	ТипыПолей.Добавить("РеквизитыТабличныхЧастей");
	ТипыПолей.Добавить("Ресурсы");
	ТипыПолей.Добавить("Измерения");
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ОчередьПолученияИзмененийОбъектовВерсийХранилища");
		ЭлементБлокировкиДанных.УстановитьЗначение("ВерсияХранилища", ВерсияХранилища);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Для Каждого КлючИЗначение Из Изменения Цикл
			ИмяОбъектаМетаданных = КлючИЗначение.Ключ;
			Для Каждого ВидСвойстваКлючИЗначение Из КлючИЗначение.Значение Цикл
				ВидСвойства = ВидСвойстваКлючИЗначение.Ключ;
				Если Не ТипыПолей.Найти(ВидСвойстваКлючИЗначение.Ключ) = Неопределено Тогда // Это поля объекта
					// Для полей есть различия в виде изменения: добавлены, изменены, удалены.
					Для Каждого ВидИзмененияКлючИЗначение Из ВидСвойстваКлючИЗначение.Значение Цикл
						ВидИзменения = ВидИзмененияКлючИЗначение.Ключ;
						Если ВидИзменения = "Изменены" Тогда
							Для Каждого ИзменениеКлючИЗначение Из ВидИзмененияКлючИЗначение.Значение Цикл
								Свойство = ИзменениеКлючИЗначение.Ключ;
								ИзмененияСвойствПолей = ИзменениеКлючИЗначение.Значение;
								ИзмененияСвойствПолейМ = Новый Массив;
								Для Каждого ИзменениеСвойстваПоля Из ИзмененияСвойствПолей Цикл
									ИзмененияСвойствПолейМ.Добавить(СтрШаблон("%1:%2", ИзменениеСвойстваПоля.Ключ, ИзменениеСвойстваПоля.Значение));
								КонецЦикла;
								Изменение = СтрСоединить(ИзмененияСвойствПолейМ, ";");
								ЗаписатьИзмененияСвойстОбъектовМетаданных(
									ВерсияХранилища,
									ИмяОбъектаМетаданных,
									Свойство,
									ВидСвойства,
									Изменение,
									ВидИзменения);
							КонецЦикла;
						Иначе // Добавлены, Удалены
							Для Каждого Свойство Из ВидИзмененияКлючИЗначение.Значение Цикл
								Изменение = ?(ВидИзменения = "Добавлены", "+++", "---");;
								ЗаписатьИзмененияСвойстОбъектовМетаданных(
									ВерсияХранилища,
									ИмяОбъектаМетаданных,
									Свойство,
									ВидСвойства,
									Изменение,
									ВидИзменения);
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли ВидСвойстваКлючИЗначение.Ключ = "Иерархия" Тогда
					// Для Иерархии только изменения свойств
					ВидИзменения = "Изменены";
					Для Каждого ИзменениеКлючИЗначение Из ВидСвойстваКлючИЗначение.Значение Цикл
						Свойство = ИзменениеКлючИЗначение.Ключ;
						Изменение = ИзменениеКлючИЗначение.Значение;
						ЗаписатьИзмененияСвойстОбъектовМетаданных(
							ВерсияХранилища,
							ИмяОбъектаМетаданных,
							Свойство,
							ВидСвойства,
							Изменение,
							ВидИзменения);
					КонецЦикла;
				Иначе // Владельцы, Движения, Предопределенные
					// Здесь только само изменение, без углубления вложенности
					ВидИзменения = "Изменены";
					Свойство = ВидСвойства;
					Изменение = ВидСвойстваКлючИЗначение.Значение;
					ЗаписатьИзмененияСвойстОбъектовМетаданных(
						ВерсияХранилища,
						ИмяОбъектаМетаданных,
						Свойство,
						ВидСвойства,
						Изменение,
						ВидИзменения);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		Менеджер = РегистрыСведений.ОчередьПолученияИзмененийОбъектовВерсийХранилища.СоздатьМенеджерЗаписи();
		Менеджер.Период = ТекущаяДатаСеанса();
		Менеджер.ВерсияХранилища = ВерсияХранилища;
		Менеджер.Статус = Перечисления.СтатусыОперацийОбработкиОчереди.Обработано;
		Менеджер.Записать();
		
		ЗафиксироватьТранзакцию();	
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			"Получение изменений версий.Получение изменений",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ИзмененияСвойствОбъектовМетаданных,
			ВерсияХранилища,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Попытка
			Менеджер = РегистрыСведений.ОчередьПолученияИзмененийОбъектовВерсийХранилища.СоздатьМенеджерЗаписи();
			Менеджер.Период = ТекущаяДатаСеанса();
			Менеджер.ВерсияХранилища = ВерсияХранилища;
			Менеджер.Статус = Перечисления.СтатусыОперацийОбработкиОчереди.Ошибка;
			Менеджер.Комментарий = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Менеджер.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(
				"Получение изменений версий.Запись в очередь",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.ОчередьПолученияИзмененийОбъектовВерсийХранилища,
				ВерсияХранилища,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьИзмененияСвойстОбъектовМетаданных(
										ВерсияХранилища,
										ИмяОбъектаМетаданных,
										Свойство,
										ВидСвойства,
										Изменение,
										ВидИзменения = "Изменено")
	Менеджер = РегистрыСведений.ИзмененияСвойствОбъектовМетаданных.СоздатьМенеджерЗаписи();
	Менеджер.ВерсияХранилища = ВерсияХранилища;
	Менеджер.ИмяОбъектаМетаданных = ИмяОбъектаМетаданных;
	Менеджер.Свойство = Свойство;
	Менеджер.ВидСвойства = ВидСвойства;
	Менеджер.Изменение = Изменение;
	Менеджер.ВидИзменения = ВидИзменения;
	
	Менеджер.Записать();
	
КонецПроцедуры

#КонецОбласти
